// Завдання 1:
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'. 

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою  
// перетворіть значення на число за допомогою Number().

// Запропонуйте користувачу ввести число
const userInput = prompt("Введіть число:");

// Перетворюємо введене значення на число
const number = Number(userInput);

// Перевіряємо, чи дорівнює число 10
if (number === 10) {
    alert("Вірно");
} else {
    alert("Невірно");
}

// Завдання 2:
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"
// const min = Math.floor(Math.random() * (59 - 0) + 0);

// Генеруємо випадкове число від 0 до 59
const min = Math.floor(Math.random() * 60);

// Визначаємо, в яку чверть години потрапляє число
if (min >= 0 && min < 15) {
    alert(`${min} входить в першу чверть`);
} else if (min >= 15 && min < 30) {
    alert(`${min} входить в другу чверть`);
} else if (min >= 30 && min < 45) {
    alert(`${min} входить в третю чверть`);
} else if (min >= 45 && min < 60) {
    alert(`${min} входить в четверту чверть`);
}